MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L4S9ZI/mcu.h
/********************  Bits definition for DCMI_CWSIZE register  **************/
#define DCMI_CWSIZE_CAPCNT_Pos        (0U)
#define DCMI_CWSIZE_CAPCNT_Msk        (0x3FFFUL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00003FFF */
#define DCMI_CWSIZE_CAPCNT            DCMI_CWSIZE_CAPCNT_Msk                   /*!< DCMI Capture count CAPCNT[13:0] */
#define DCMI_CWSIZE_CAPCNT_0          (0x0001UL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00000001 */
#define DCMI_CWSIZE_CAPCNT_1          (0x0002UL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00000002 */
#define DCMI_CWSIZE_CAPCNT_2          (0x0004UL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00000004 */
#define DCMI_CWSIZE_CAPCNT_3          (0x0008UL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00000008 */
#define DCMI_CWSIZE_CAPCNT_4          (0x0010UL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00000010 */
#define DCMI_CWSIZE_CAPCNT_5          (0x0020UL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00000020 */
#define DCMI_CWSIZE_CAPCNT_6          (0x0040UL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00000040 */
#define DCMI_CWSIZE_CAPCNT_7          (0x0080UL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00000080 */
#define DCMI_CWSIZE_CAPCNT_8          (0x0100UL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00000100 */
#define DCMI_CWSIZE_CAPCNT_9          (0x0200UL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00000200 */
#define DCMI_CWSIZE_CAPCNT_10         (0x0400UL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00000400 */
#define DCMI_CWSIZE_CAPCNT_11         (0x0800UL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00000800 */
#define DCMI_CWSIZE_CAPCNT_12         (0x1000UL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00001000 */
#define DCMI_CWSIZE_CAPCNT_13         (0x2000UL << DCMI_CWSIZE_CAPCNT_Pos)     /*!< 0x00002000 */
#define DCMI_CWSIZE_VLINE_Pos         (16U)
#define DCMI_CWSIZE_VLINE_Msk         (0x3FFFUL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x3FFF0000 */
#define DCMI_CWSIZE_VLINE             DCMI_CWSIZE_VLINE_Msk                    /*!< DCMI Vertical line count VLINE[13:0] */
#define DCMI_CWSIZE_VLINE_0           (0x0001UL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x00010000 */
#define DCMI_CWSIZE_VLINE_1           (0x0002UL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x00020000 */
#define DCMI_CWSIZE_VLINE_2           (0x0004UL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x00040000 */
#define DCMI_CWSIZE_VLINE_3           (0x0008UL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x00080000 */
#define DCMI_CWSIZE_VLINE_4           (0x0010UL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x00100000 */
#define DCMI_CWSIZE_VLINE_5           (0x0020UL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x00200000 */
#define DCMI_CWSIZE_VLINE_6           (0x0040UL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x00400000 */
#define DCMI_CWSIZE_VLINE_7           (0x0080UL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x00800000 */
#define DCMI_CWSIZE_VLINE_8           (0x0100UL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x01000000 */
#define DCMI_CWSIZE_VLINE_9           (0x0200UL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x02000000 */
#define DCMI_CWSIZE_VLINE_10          (0x0400UL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x04000000 */
#define DCMI_CWSIZE_VLINE_11          (0x0800UL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x08000000 */
#define DCMI_CWSIZE_VLINE_12          (0x1000UL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x10000000 */
#define DCMI_CWSIZE_VLINE_13          (0x2000UL << DCMI_CWSIZE_VLINE_Pos)      /*!< 0x20000000 */

/********************  Bits definition for DCMI_DR register  **************/
#define DCMI_DR_BYTE0_Pos             (0U)
#define DCMI_DR_BYTE0_Msk             (0xFFUL << DCMI_DR_BYTE0_Pos)            /*!< 0x000000FF */
#define DCMI_DR_BYTE0                 DCMI_DR_BYTE0_Msk                        /*!< DCMI Data byte 0 Byte0[7:0] */
#define DCMI_DR_BYTE0_0               (0x01UL << DCMI_DR_BYTE0_Pos)            /*!< 0x00000001 */
#define DCMI_DR_BYTE0_1               (0x02UL << DCMI_DR_BYTE0_Pos)            /*!< 0x00000002 */
#define DCMI_DR_BYTE0_2               (0x04UL << DCMI_DR_BYTE0_Pos)            /*!< 0x00000004 */
#define DCMI_DR_BYTE0_3               (0x08UL << DCMI_DR_BYTE0_Pos)            /*!< 0x00000008 */
#define DCMI_DR_BYTE0_4               (0x10UL << DCMI_DR_BYTE0_Pos)            /*!< 0x00000010 */
#define DCMI_DR_BYTE0_5               (0x20UL << DCMI_DR_BYTE0_Pos)            /*!< 0x00000020 */
#define DCMI_DR_BYTE0_6               (0x40UL << DCMI_DR_BYTE0_Pos)            /*!< 0x00000040 */
#define DCMI_DR_BYTE0_7               (0x80UL << DCMI_DR_BYTE0_Pos)            /*!< 0x00000080 */
#define DCMI_DR_BYTE1_Pos             (8U)
#define DCMI_DR_BYTE1_Msk             (0xFFUL << DCMI_DR_BYTE1_Pos)            /*!< 0x0000FF00 */
#define DCMI_DR_BYTE1                 DCMI_DR_BYTE1_Msk                        /*!< DCMI Data byte 1 Byte1[7:0] */
#define DCMI_DR_BYTE1_0               (0x01UL << DCMI_DR_BYTE1_Pos)            /*!< 0x00000100 */
#define DCMI_DR_BYTE1_1               (0x02UL << DCMI_DR_BYTE1_Pos)            /*!< 0x00000200 */
#define DCMI_DR_BYTE1_2               (0x04UL << DCMI_DR_BYTE1_Pos)            /*!< 0x00000400 */
#define DCMI_DR_BYTE1_3               (0x08UL << DCMI_DR_BYTE1_Pos)            /*!< 0x00000800 */
#define DCMI_DR_BYTE1_4               (0x10UL << DCMI_DR_BYTE1_Pos)            /*!< 0x00001000 */
#define DCMI_DR_BYTE1_5               (0x20UL << DCMI_DR_BYTE1_Pos)            /*!< 0x00002000 */
#define DCMI_DR_BYTE1_6               (0x40UL << DCMI_DR_BYTE1_Pos)            /*!< 0x00004000 */
#define DCMI_DR_BYTE1_7               (0x80UL << DCMI_DR_BYTE1_Pos)            /*!< 0x00008000 */
#define DCMI_DR_BYTE2_Pos             (16U)
#define DCMI_DR_BYTE2_Msk             (0xFFUL << DCMI_DR_BYTE2_Pos)            /*!< 0x00FF0000 */
#define DCMI_DR_BYTE2                 DCMI_DR_BYTE2_Msk                        /*!< DCMI Data byte 2 Byte2[7:0] */
#define DCMI_DR_BYTE2_0               (0x01UL << DCMI_DR_BYTE2_Pos)            /*!< 0x00010000 */
#define DCMI_DR_BYTE2_1               (0x02UL << DCMI_DR_BYTE2_Pos)            /*!< 0x00020000 */
#define DCMI_DR_BYTE2_2               (0x04UL << DCMI_DR_BYTE2_Pos)            /*!< 0x00040000 */
#define DCMI_DR_BYTE2_3               (0x08UL << DCMI_DR_BYTE2_Pos)            /*!< 0x00080000 */
#define DCMI_DR_BYTE2_4               (0x10UL << DCMI_DR_BYTE2_Pos)            /*!< 0x00100000 */
#define DCMI_DR_BYTE2_5               (0x20UL << DCMI_DR_BYTE2_Pos)            /*!< 0x00200000 */
#define DCMI_DR_BYTE2_6               (0x40UL << DCMI_DR_BYTE2_Pos)            /*!< 0x00400000 */
#define DCMI_DR_BYTE2_7               (0x80UL << DCMI_DR_BYTE2_Pos)            /*!< 0x00800000 */
#define DCMI_DR_BYTE3_Pos             (24U)
#define DCMI_DR_BYTE3_Msk             (0xFFUL << DCMI_DR_BYTE3_Pos)            /*!< 0xFF000000 */
#define DCMI_DR_BYTE3                 DCMI_DR_BYTE3_Msk                        /*!< DCMI Data byte 3 Byte3[7:0] */
#define DCMI_DR_BYTE3_0               (0x01UL << DCMI_DR_BYTE3_Pos)            /*!< 0x01000000 */
#define DCMI_DR_BYTE3_1               (0x02UL << DCMI_DR_BYTE3_Pos)            /*!< 0x02000000 */
#define DCMI_DR_BYTE3_2               (0x04UL << DCMI_DR_BYTE3_Pos)            /*!< 0x04000000 */
#define DCMI_DR_BYTE3_3               (0x08UL << DCMI_DR_BYTE3_Pos)            /*!< 0x08000000 */
#define DCMI_DR_BYTE3_4               (0x10UL << DCMI_DR_BYTE3_Pos)            /*!< 0x10000000 */
#define DCMI_DR_BYTE3_5               (0x20UL << DCMI_DR_BYTE3_Pos)            /*!< 0x20000000 */
#define DCMI_DR_BYTE3_6               (0x40UL << DCMI_DR_BYTE3_Pos)            /*!< 0x40000000 */
#define DCMI_DR_BYTE3_7               (0x80UL << DCMI_DR_BYTE3_Pos)            /*!< 0x80000000 */

/******************************************************************************/
/*                                                                            */
/*                 Digital Filter for Sigma Delta Modulators                  */
/*                                                                            */
/******************************************************************************/

/****************   DFSDM channel configuration registers  ********************/

